rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
static ble_uuid_t m_sr_uuids[] =                                               /**< Universally unique service identifiers. */
{
    {SENSOR_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}
};

//TWI Parameters
#if TWI0_ENABLED
#define INTERNAL_TWI_INSTANCE_ID     0
#endif

#if TWI1_ENABLED
#define EXTERNAL_TWI_INSTANCE_ID     1
#endif

const nrf_drv_twi_t m_twi_internal = NRF_DRV_TWI_INSTANCE(INTERNAL_TWI_INSTANCE_ID);
const nrf_drv_twi_t m_twi_external = NRF_DRV_TWI_INSTANCE(EXTERNAL_TWI_INSTANCE_ID);

volatile bool m_xfer_internal_done = false; //Indicates if operation on the internal TWI bus has ended.
volatile bool m_xfer_external_done = false; //Indicates if operation on the external TWI bus has ended.

volatile bool m_data_ready  = false; //Indicates if radio has finished broadcasting data via notification

static int m_twi_internal_bus_status;                                                    /**< lets us know the status of the internal TWI bus after each communication attempt on the bus */
static int m_twi_external_bus_status;                                                    /**< lets us know the status of the external TWI bus after each communication attempt on the bus */

static int measurements_taken = 0;                                              /**< keeps track of how many IMU measurements have taken in the given connection interval. */

//IMU Sensor Parameters
static uint8_t default_sensors[3] = {FXOS8700_ACC, LSM9DS1_GYR, FXOS8700_MAG};  /**< Default sensors that are attempted to be initialized first. */
//static uint8_t default_sensors[3] = {LSM9DS1_ACC, LSM9DS1_GYR, LSM9DS1_MAG};  /**< Default sensors that are attempted to be initialized first. */
static bool sensors_initialized[3] = {false, false, false};                     /**< Keep track of which sensors are currently initialized */
static uint8_t internal_sensors[10];                                            /**< An array for holding the addresses of sensors on the internal TWI line */
static uint8_t external_sensors[10];                                            /**< An array for holding the addresses of sensors on the external TWI line */

static uint8_t internal_sensors_found = 0;
static uint8_t external_sensors_found = 0;

static int32_t sensor_read_register(void *bus, uint8_t add, uint8_t reg, uint8_t *bufp, uint16_t len); //function declaration for reading sensor registers
static int32_t sensor_write_register(void *bus, uint8_t add, uint8_t reg, const uint8_t *bufp); //function declaration for writing sensor registers

static stmdev_ctx_t lsm9ds1_imu;                                                /**< LSM9DS1 accelerometer/gyroscope instance. */
static stmdev_ctx_t lsm9ds1_mag;                                                /**< LSM9DS1 magnetometer instance. */

APP_TIMER_DEF(m_data_reading_timer);                                            /**< A timer used for collecting data from the LSM9DS1 (interrupts are disabled so a timer is needed). */
APP_TIMER_DEF(m_led_timer);                                                     /**< A timer used for LED timing */
#define NEXT_MEASUREMENT_DELAY          APP_TIMER_TICKS(1500)                   /**< Defines the delay between Sensor Measurments (1500 milliseconds). */
#define LED_DELAY                       APP_TIMER_TICKS(2000)                   /**< Defines the delay between LED blinks */
const nrf_drv_timer_t LED_ON_TIMER =    NRF_DRV_TIMER_INSTANCE(1);              /**< Timer to keep track of how long LEDs are turned on during a blink */

static uint8_t acc_characteristic_data[SENSOR_SAMPLES * SAMPLE_SIZE];
static uint8_t gyr_characteristic_data[SENSOR_SAMPLES * SAMPLE_SIZE];
static uint8_t mag_characteristic_data[SENSOR_SAMPLES * SAMPLE_SIZE];
uint8_t sensor_settings[SENSOR_SETTINGS_LENGTH];                               /**< An array represnting the IMU sensor settings */

static int32_t write_imu(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len);
static int32_t read_imu(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len);
static int32_t write_mag(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len);
static int32_t read_mag(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len);
static void tx_com( uint8_t *tx_buffer, uint16_t len );
static int32_t get_IMU_data(uint8_t offset);
static int32_t get_MAG_data(uint8_t offset);
static float current_sensor_odr = 59.5;         //keeps track of the current sensor ODR to let us know if we need to update the connection interval

static personal_caddie_operating_mode_t current_operating_mode = ADVERTISING_MODE; /**< The chip starts in advertising mode*/

//Pin Setup
#define USE_EXTERNAL_SENSORS      false                                            /**< Let's the BLE33 know tuat external sensors are being used*/
#define USE_EXTERNAL_LEDS         false                                            /**< Let's the BLE33 know that external LEDs are being used*/
#define EXTERNAL_SENSOR_POWER_PIN NRF_GPIO_PIN_MAP(1, 10)                         /**< Pin used to power external sensors (mapped to D9 on BLE 33)*/
#define EXTERNAL_SCL_PIN          NRF_GPIO_PIN_MAP(0, 21)                         /**< Pin used for external TWI clock (mapped to D8 on BLE 33) */
#define EXTERNAL_SDA_PIN          NRF_GPIO_PIN_MAP(0, 23)                          /**< Pin used for external TWI data (mapped to D7 on BLE 33) */
//#define EXTERNAL_SCL_PIN          NRF_GPIO_PIN_MAP(0, 26)                         /**< Pin used for external TWI clock (mapped to D8 on BLE 33) */
//#define EXTERNAL_SDA_PIN          NRF_GPIO_PIN_MAP(0, 27)                          /**< Pin used for external TWI data (mapped to D10 on BLE 33) */
#define EXTERNAL_RED_LED          NRF_GPIO_PIN_MAP(1, 15)                         /**< Pin used for powering an external red LED (mapped to D4 on BLE 33)*/
#define EXTERNAL_BLUE_LED         NRF_GPIO_PIN_MAP(1, 13)                         /**< Pin used for powering an external blue LED (mapped to D5 on BLE 33)*/
#define EXTERNAL_GREEN_LED        NRF_GPIO_PIN_MAP(1, 14)                         /**< Pin used for powering an external green LED (mapped to D6 on BLE 33)*/
#define BLE_33_SENSOR_POWER_PIN   NRF_GPIO_PIN_MAP(0, 22)                         /**< Pin used to power BLE33 onboard sensors*/
#define BLE_33_SCL_PIN            NRF_GPIO_PIN_MAP(0, 15)                         /**< Pin used for internal TWI clock for BLE33*/
#define BLE_33_SDA_PIN            NRF_GPIO_PIN_MAP(0, 14)                         /**< Pin used for internal TWI data for BLE33*/
#define BLE_33_PULLUP             NRF_GPIO_PIN_MAP(1, 0)                          /**< Pullup resistors on BLE 33 sense have separate power source*/
#define BLE_33_BAD_GREEN_LED      NRF_GPIO_PIN_MAP(1, 9)                          /**< low efficiency Green LED Indicator on BLE 33 sense*/
#define BLE_33_RED_LED            NRF_GPIO_PIN_MAP(0, 24)                         /**< Red LED Indicator on BLE 33 sense*/
#define BLE_33_BLUE_LED           NRF_GPIO_PIN_MAP(0, 6)                          /**< Blue LED Indicator on BLE 33 sense*/
#define BLE_33_GREEN_LED          NRF_GPIO_PIN_MAP(0, 16)                         /**< Green LED Indicator on BLE 33 sense*/
static volatile uint8_t active_led = USE_EXTERNAL_LEDS ? EXTERNAL_BLUE_LED : BLE_33_BLUE_LED;                             /**< Variable used to keep track of which LED to turn on/off*/

imu_communication_t imu_comm;                                                          /**< Holds information on how to communicate with each sensor*/

static void advertising_start(bool erase_bonds);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


