rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
/**@brief Function for handling Peer Manager events                   
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

static void twi_address_scan(uint8_t* addresses, uint8_t* device_count, nrf_drv_twi_t const * bus)
{
    //This method scans for all possible TWI addresses on the current bus. If an
    //address is found it gets added to the given array of addresses and the cound
    //of device gets incremented.
    uint8_t sample_data;

    for (uint8_t add = 0; add <= 127; add++)
    {
        ret_code_t err_code;
        
        //set the m_xfer_done bool to false given the current TWI bus
        uint8_t instance = ((nrf_drv_twi_t const*)bus)->inst_idx;
        volatile bool * m_xfer_done;
        if (instance == INTERNAL_TWI_INSTANCE_ID) m_xfer_done = &m_xfer_internal_done; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)
        else m_xfer_done = &m_xfer_external_done;

        *m_xfer_done = false;

        do
        {
            err_code = nrf_drv_twi_rx(bus, add, &sample_data, sizeof(sample_data));
        } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
        while (*m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

        //If a sensor was found so we add it to the list, get the bus status from the 
        //current twi bus and add the current address if we get an ACK
        int* m_twi_bus_status;
        if (instance == INTERNAL_TWI_INSTANCE_ID) m_twi_bus_status = &m_twi_internal_bus_status;
        else m_twi_bus_status = &m_twi_external_bus_status;

        if (*m_twi_bus_status == NRF_DRV_TWI_EVT_DONE) addresses[(*device_count)++] = add;
    }
}

static void disable_twi_bus(int instance_id)
{
    //this method disables a currently enabled twi bus, as well as shuts
    //off power to any gpio pins that it requires.
    if (instance_id == INTERNAL_TWI_INSTANCE_ID)
    {
        nrf_gpio_pin_clear(BLE_33_PULLUP);
        nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);

        nrf_drv_twi_disable(&m_twi_internal); //disable the current bus
    }
    else
    {
        nrf_gpio_pin_clear(EXTERNAL_SENSOR_POWER_PIN);

        nrf_drv_twi_disable(&m_twi_external); //disable the current bus
    }
}

static void enable_twi_bus(int instance_id)
{
    //This method enables the given twi bus instance, as well as turns on any 
    //necessary power and pullup resistor pins. Before enabling, make sure the
    //current instance isn't already enabled as this will cause an error.
    if (instance_id == INTERNAL_TWI_INSTANCE_ID)
    {
        if (!m_twi_internal.u.twim.p_twim->ENABLE)
        {
            //Send power to the internal sensors and the pullup resistor,
            //also make sure that power for the external sensors is off
            nrf_gpio_pin_set(BLE_33_PULLUP);
            nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);

            nrf_drv_twi_enable(&m_twi_internal); //enable the bus
        }
    }
    else
    {
        if (!m_twi_external.u.twim.p_twim->ENABLE)
        {
            //Send power to the external sensors. also make sure that power,
            //afor the internal sensors and the pullup resistor is off
            nrf_gpio_pin_set(EXTERNAL_SENSOR_POWER_PIN);

            nrf_drv_twi_enable(&m_twi_external); //enable the bus
        }
    }

    nrf_delay_ms(50); //slight delay so sensors have time to power on
}

static void sensor_communication_init(sensor_type_t type, uint8_t model, uint8_t address, nrf_drv_twi_t const * bus)
{
    switch (type)
    {
        case ACC_SENSOR:
            imu_comm.acc_comm.address = address;
            imu_comm.acc_comm.twi_bus = bus;
            imu_comm.acc_comm.read_register = sensor_read_register;
            imu_comm.acc_comm.write_register = sensor_write_register;
            if (model == LSM9DS1_ACC)
            {
                imu_comm.acc_comm.update_settings = lsm9ds1_acc_apply_setting;
                imu_comm.acc_comm.get_data = lsm9ds1_get_acc_data;
            }
            else if (model == FXOS8700_ACC)
            {
                imu_comm.acc_comm.update_settings = fxos8700_acc_apply_setting;
                imu_comm.acc_comm.get_data = fxos8700_get_acc_data;
            }
            break;
        case GYR_SENSOR:
            imu_comm.gyr_comm.address = address;
            imu_comm.gyr_comm.twi_bus = bus;
            imu_comm.gyr_comm.read_register = sensor_read_register;
            imu_comm.gyr_comm.write_register = sensor_write_register;
            if (model == LSM9DS1_GYR)
            {
                imu_comm.gyr_comm.update_settings = lsm9ds1_gyr_apply_setting;
                imu_comm.gyr_comm.get_data = lsm9ds1_get_gyr_data;
            }
            else if (model == FXAS21002_GYR)
            {
                //TODO: add methods here after adding driver
            }
            break;
        case MAG_SENSOR:
            imu_comm.mag_comm.address = address;
            imu_comm.mag_comm.twi_bus = bus;
            imu_comm.mag_comm.read_register = sensor_read_register;
            imu_comm.mag_comm.write_register = sensor_write_register;
            if (model == LSM9DS1_MAG)
            {
                imu_comm.mag_comm.update_settings = lsm9ds1_mag_apply_setting;
                imu_comm.mag_comm.get_data = lsm9ds1_get_mag_data;
            }
            else if (model == FXOS8700_MAG)
            {
                imu_comm.mag_comm.update_settings = fxos8700_mag_apply_setting;
                imu_comm.mag_comm.get_data = fxos8700_get_mag_data;
            }
            break;
    }
}

