rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //set the m_xfer_done bool to false given the current TWI bus
    uint8_t instance = ((nrf_drv_twi_t const*)bus)->inst_idx;
    volatile bool * m_xfer_done;
    if (instance == INTERNAL_TWI_INSTANCE_ID) m_xfer_done = &m_xfer_internal_done; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)
    else m_xfer_done = &m_xfer_external_done;

    *m_xfer_done = false;

    do
    {
        err_code = nrf_drv_twi_xfer((nrf_drv_twi_t const*)bus, &sensor_read, 0); //no flags needed here
    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    while (*m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

    APP_ERROR_CHECK(err_code);
    return (int32_t)err_code;
}
static int32_t sensor_write_register(void *bus, uint8_t add, uint8_t reg, const uint8_t *bufp)
{
    //This method is for writing data to a single register for a sensor
    ret_code_t err_code = 0;

    uint8_t register_and_data[2] = {reg, bufp[0]};

    //the primary buffer will hold the register address, as well as the value to write into it.
    //for a single write operation, the secondary buffer has no use in a single write command
    const nrf_drv_twi_xfer_desc_t sensor_write = {
        .address = add,
        .primary_length = 2,
        .secondary_length = 0,
        .p_primary_buf = register_and_data,
        .p_secondary_buf = NULL,
        .type =  NRF_DRV_TWI_XFER_TX};

    //set the m_xfer_done bool to false given the current TWI bus
    uint8_t instance = ((nrf_drv_twi_t const*)bus)->inst_idx;
    volatile bool * m_xfer_done;
    if (instance == INTERNAL_TWI_INSTANCE_ID) m_xfer_done = &m_xfer_internal_done; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)
    else m_xfer_done = &m_xfer_external_done;

    *m_xfer_done = false;

    do
    {
        err_code = nrf_drv_twi_xfer((nrf_drv_twi_t const*)bus, &sensor_write, 0); //no flags needed here
    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    while (*m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

    APP_ERROR_CHECK(err_code);
    return (int32_t)err_code;
}

/**
 * @}
 */
